In [3]:
import pandas as pd

In [4]:
Q = pd.read_excel('Date & Discharge .xlsx', index_col=0)
Q

           Date  MeanDailyDischarge(m3/s)
0    1994-01-01                      7.60
1    1994-01-02                      7.54
2    1994-01-03                      7.55
3    1994-01-04                      7.57
4    1994-01-05                      7.52
...         ...                       ...
7861 2021-12-27                     29.28
7862 2021-12-28                     28.42
7863 2021-12-29                     27.92
7864 2021-12-30                     27.36
7865 2021-12-31                     26.49

[7866 rows x 2 columns]

In [5]:
WL = pd.read_excel('Date & WL .xlsx', index_col=0)
WL

            Date  AVE_WL(m)
0     1994-01-01       2.62
1     1994-01-02       2.61
2     1994-01-03       2.60
3     1994-01-04       2.60
4     1994-01-05       2.59
...          ...        ...
10683 2023-12-27       1.55
10684 2023-12-28       1.53
10685 2023-12-29       1.52
10686 2023-12-30       1.51
10687 2023-12-31       1.48

[10688 rows x 2 columns]

#common Q & WL data

In [6]:
df = pd.merge(Q, WL, on='Date')
df

           Date  MeanDailyDischarge(m3/s)  AVE_WL(m)
0    1994-01-01                      7.60       2.62
1    1994-01-02                      7.54       2.61
2    1994-01-03                      7.55       2.60
3    1994-01-04                      7.57       2.60
4    1994-01-05                      7.52       2.59
...         ...                       ...        ...
7861 2021-12-27                     29.28       1.72
7862 2021-12-28                     28.42       1.69
7863 2021-12-29                     27.92       1.68
7864 2021-12-30                     27.36       1.66
7865 2021-12-31                     26.49       1.62

[7866 rows x 3 columns]

In [7]:
df.to_excel('Common Q & WL data .xlsx')